[Reference](https://medium.com/@tubelwj/how-to-map-column-values-in-a-pandas-dataframe-0b4e3f12cff9)

In [1]:
import pandas as pd

df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "sex": ["female", "male", "male", "male", "female", "male"],
    "age": [23, 34, 29, 42, 25, 31],
})

df.sex = df.sex.map({
    "female": 0,
    "male": 1,
})

print(df)

      name  sex  age
0    Alice    0   23
1      Bob    1   34
2  Charlie    1   29
3    David    1   42
4      Eva    0   25
5    Frank    1   31

In [2]:
import pandas as pd

df = pd.DataFrame({
    "name": ["John", "Emily", "Michael", "Sarah", "James", "Olivia"],
    "sex": ["male", "female", "male", "female", "male", "female"],
    "grade": ["A", "B", "C", "A", "B", "C"],
})

df.sex = df.sex.factorize()[0]
df.grade = df.grade.factorize()[0]
print(df)

      name  sex  grade
0     John    0      0
1    Emily    1      1
2  Michael    0      2
3    Sarah    1      0
4    James    0      1
5   Olivia    1      2

In [5]:
df.grade.factorize()

(array([0, 1, 2, 0, 1, 2]), Index([0, 1, 2], dtype='int64'))

In [6]:
df.grade = df.grade.factorize()[0]
df.grade = (df.grade == 2).astype("int")
print(df)

      name  sex  grade
0     John    0      0
1    Emily    1      0
2  Michael    0      1
3    Sarah    1      0
4    James    0      0
5   Olivia    1      1